{
    "case_id": "001-174968",
    "article": "5",
    "judgment": "violation",
    "parties": [
        "GERMANY",
        "BECHT"
    ],
    "all_arguments": [
        {
            "paragraph_id": "9a0294b2-0b87-44e5-81ad-60b1584768a2",
            "start": 0,
            "end": 243,
            "text": "The applicant complained that his preventive detention beyond the former statutory ten-year maximum duration had breached his right to liberty as provided in Article 5 § 1 of the Convention, which, in so far as relevant, reads as follows:",
            "agent": "Applicant",
            "paragraph_num": 25
        },
        {
            "paragraph_id": "8111cbc8-13db-4b28-8d23-bde3e15aae0f",
            "start": 0,
            "end": 184,
            "text": "“1. Everyone has the right to liberty and security of person. No one shall be deprived of his liberty save in the following cases and in accordance with a procedure prescribed by law:",
            "agent": "Non-Argument",
            "paragraph_num": 25
        },
        {
            "paragraph_id": "de5d0587-4441-438a-8bf9-de855ff5bb00",
            "start": 0,
            "end": 164,
            "text": "(e) the lawful detention of persons for the prevention of the spreading of infectious diseases, of persons of unsound mind, alcoholics or drug addicts or vagrants;",
            "agent": "Non-Argument",
            "paragraph_num": 25
        },
        {
            "paragraph_id": "80a8fee8-13b2-4d58-b1d2-5a82be1b4c20",
            "start": 0,
            "end": 44,
            "text": "The Government contested that argument.",
            "agent": "State",
            "paragraph_num": 26
        },
        {
            "paragraph_id": "c1ce6a12-4daa-4eb6-b50c-247a841b7c10",
            "start": 0,
            "end": 239,
            "text": "The Court notes that this complaint is not manifestly ill-founded within the meaning of Article 35 § 3 (a) of the Convention. It further notes that it is not inadmissible on any other grounds. It must therefore be declared admissible.",
            "agent": "ECHR",
            "paragraph_num": 27
        },
        {
            "paragraph_id": "f0b1ffd9-bacc-4e07-9aed-34d1d8c857b0",
            "start": 0,
            "end": 769,
            "text": "The applicant took the view that his preventive detention at issue had violated Article 5 § 1 of the Convention. In particular, his detention had not been justified under Article 5 § 1 (e). The personality disorder he allegedly suffered from, which 80 to 90 per cent of the prison population could be diagnosed with, was, in any event, not pathological and not serious enough for his being classified as of “unsound mind”, that is, mentally ill as required by that provision. Furthermore, Schwalmstadt/Weiterstadt prisons, in which he had been detained, had not been suitable institutions for persons of unsound mind. He had not been offered sufficient therapies tailored to the needs of a mental health patient and had never been placed in a psychiatric hospital.",
            "agent": "Applicant",
            "paragraph_num": 28
        },
        {
            "paragraph_id": "f1530eae-83b1-4296-aad2-bc127224f1b2",
            "start": 0,
            "end": 709,
            "text": "In the Government’s submission, the applicant’s preventive detention had been justified under sub-paragraph (e) of Article 5 § 1. The applicant was a person “of unsound mind” for the purposes of that provision. The domestic courts, having regard to a recent psychiatric expert report, had found in the two sets of proceedings at issue that the applicant suffered from a sufficiently serious, and thus a true mental disorder, namely a dissocial and schizoid personality disorder. Moreover, the applicant had been detained in suitable institutions for the treatment of his mental disorder in the period at issue, in particular, as a result of the offers of therapy made to him (see paragraphs 18-20 above).",
            "agent": "State",
            "paragraph_num": 29
        },
        {
            "paragraph_id": "d3c73445-1274-4e23-a054-44395754ba6a",
            "start": 0,
            "end": 201,
            "text": "For a summary of the relevant principles in respect of Article 5 § 1 (e) the Court refers to the recapitulation of those principles in its judgment in the case of Bergmann (cited above, §§ 95-99).",
            "agent": "ECHR",
            "paragraph_num": 30
        },
        {
            "paragraph_id": "c794e961-fcdf-4615-9372-c29049abbc9c",
            "start": 0,
            "end": 1308,
            "text": "In determining whether the applicant’s retrospectively extended preventive detention was justified under sub-paragraph (e) of Article 5 § 1 as detention of a person “of unsound mind”, the Court, having regard to the elements before it, is satisfied that it was established before the competent domestic courts on the basis of objective medical expertise that the applicant suffered from a true mental disorder for the purposes of that provision. It notes, in particular, that the domestic courts endorsed the findings made by psychiatric expert J., in line with the previous findings of another psychiatric expert, that the applicant suffered from a dissocial and schizoid personality disorder as defined by the ICD-10. That disorder was of a sufficiently serious nature, had manifested itself in the serious offences including rape of randomly chosen victims committed by him and necessitated specific therapeutic treatment. Moreover, in view of the high risk that the applicant would commit further similar serious offences if released, the applicant’s mental disorder was shown to be of a kind or degree warranting compulsory confinement, which, furthermore, depended upon the persistence of that disorder. The applicant was therefore a person “of unsound mind” for the purposes of Article 5 § 1 (e).",
            "agent": "ECHR",
            "paragraph_num": 31
        },
        {
            "paragraph_id": "85388825-2a50-4b04-a57d-06b267067857",
            "start": 0,
            "end": 1165,
            "text": "As for the lawfulness of the applicant’s detention at issue, ordered under Article 67d § 3 of the Criminal Code read in conjunction with the Federal Constitutional Court’s judgment of 4 May 2011, the Court, having regard to the requirements established in its case-law (see paragraph 30 above), must examine whether that detention was effected in a hospital, clinic or other appropriate institution for mental health patients. It observes that during the period here at issue, the applicant was initially detained, from 9 April 2012 (when he had served ten years in preventive detention) until January 2013, in a separate department for persons in preventive detention in Schwalmstadt Prison. The Court, referring to its established case-law in this respect (see, inter alia, O.H. v. , no. 4646/08, §§ 87-92, 24 November 2011; Kronfeldner v. , no. 21906/09, §§ 80-85, 19 January 2012; and Glien v. Germany, no. 7345/12, §§ 92 et seq., 28 November 2013), finds that during the time in which the applicant was detained in Schwalmstadt Prison in the said department, he had not been remanded in an institution suitable for the detention of mental health patients.",
            "agent": "ECHR",
            "paragraph_num": 32
        },
        {
            "paragraph_id": "cfdf7701-6119-48f1-847b-140b51a840c2",
            "start": 0,
            "end": 1298,
            "text": "From January 2013 until a fresh periodic review decision extending the applicant’s preventive detention was taken on 18 November 2013, the applicant was detained in a separate building for persons in preventive detention on the premises of Weiterstadt Prison. In the latter institution, the conditions of detention for persons in preventive detention and the offers of therapy were gradually improved so as to comply with the requirements of the Preventive Detention (Distinction) Act. Having regard to the material before it, the Court observes that in the applicant’s case, there was a considerable change in the institutional setting, the general staffing situation particularly in the psychology service and concerning specific offers of therapy made to the applicant in order to address his mental disorder. In particular, the applicant was repeatedly invited to participate in a sex offender treatment programme in May 2013. The Court can therefore accept that from May 2013 onwards, the applicant was offered the therapeutic environment appropriate for a person detained for being of unsound mind in the building on the premises of Weiterstadt Prison and was thus detained in a suitable institution for the purposes of Article 5 § 1 (e) (compare also Bergmann, cited above, §§ 118-128).",
            "agent": "ECHR",
            "paragraph_num": 33
        },
        {
            "paragraph_id": "5cfec6a4-dc94-4b6a-a7fb-1dd87d900ce6",
            "start": 0,
            "end": 408,
            "text": "It follows that the applicant’s retrospectively extended preventive detention was justified under Article 5 § 1 (e) in the period from May 2013 until 18 November 2013. In contrast, it was not justified under subparagraph (e) of Article 5 § 1 as the lawful detention of a person “of unsound mind”, or under any of the other sub-paragraphs of Article 5 § 1, in the period from 9 April 2012 until May 2013.",
            "agent": "ECHR",
            "paragraph_num": 34
        },
        {
            "paragraph_id": "a8b39018-0ede-44ba-98dc-a195b1199eb2",
            "start": 0,
            "end": 170,
            "text": "There has accordingly been a violation of Article 5 § 1 of the Convention (only) in respect of the applicant’s preventive detention from 9 April 2012 until May 2013.",
            "agent": "ECHR",
            "paragraph_num": 35
        }
    ],
    "input_arguments": [
        {
            "paragraph_id": "9a0294b2-0b87-44e5-81ad-60b1584768a2",
            "start": 0,
            "end": 243,
            "text": "The applicant complained that his preventive detention beyond the former statutory ten-year maximum duration had breached his right to liberty as provided in Article 5 § 1 of the Convention, which, in so far as relevant, reads as follows:",
            "agent": "Applicant",
            "paragraph_num": 25,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9990260004997253,
                    "word": "The applicant complained that his preventive detention beyond the former statutory ten - year maximum duration had breached his right to liberty as provided in Article 5 § 1 of the Convention, which, in so far as relevant, reads as follows :",
                    "start": 0,
                    "end": 238,
                    "claim": true
                }
            ]
        },
        {
            "paragraph_id": "8111cbc8-13db-4b28-8d23-bde3e15aae0f",
            "start": 0,
            "end": 184,
            "text": "“1. Everyone has the right to liberty and security of person. No one shall be deprived of his liberty save in the following cases and in accordance with a procedure prescribed by law:",
            "agent": "Non-Argument",
            "paragraph_num": 25,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9957908391952515,
                    "word": "Everyone has the right to liberty and security of person.",
                    "start": 4,
                    "end": 61,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9983674883842468,
                    "word": "No one shall be deprived of his liberty save in the following cases and in accordance with a procedure prescribed by law :",
                    "start": 62,
                    "end": 183,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "de5d0587-4441-438a-8bf9-de855ff5bb00",
            "start": 0,
            "end": 164,
            "text": "(e) the lawful detention of persons for the prevention of the spreading of infectious diseases, of persons of unsound mind, alcoholics or drug addicts or vagrants;",
            "agent": "Non-Argument",
            "paragraph_num": 25,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9883530139923096,
                    "word": "( e ) the lawful detention of persons for the prevention of the spreading of infectious diseases, of persons of unsound mind, alcoholics or drug addicts or vagrants ;",
                    "start": 0,
                    "end": 163,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "f0b1ffd9-bacc-4e07-9aed-34d1d8c857b0",
            "start": 0,
            "end": 769,
            "text": "The applicant took the view that his preventive detention at issue had violated Article 5 § 1 of the Convention. In particular, his detention had not been justified under Article 5 § 1 (e). The personality disorder he allegedly suffered from, which 80 to 90 per cent of the prison population could be diagnosed with, was, in any event, not pathological and not serious enough for his being classified as of “unsound mind”, that is, mentally ill as required by that provision. Furthermore, Schwalmstadt/Weiterstadt prisons, in which he had been detained, had not been suitable institutions for persons of unsound mind. He had not been offered sufficient therapies tailored to the needs of a mental health patient and had never been placed in a psychiatric hospital.",
            "agent": "Applicant",
            "paragraph_num": 28,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9997052550315857,
                    "word": "The applicant took the view that his preventive detention at issue had violated Article 5 § 1 of the Convention.",
                    "start": 0,
                    "end": 112,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997078776359558,
                    "word": "In particular, his detention had not been justified under Article 5 § 1 ( e ).",
                    "start": 113,
                    "end": 189,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998152256011963,
                    "word": "The personality disorder he allegedly suffered from, which 80 to 90 per cent of the prison population could be diagnosed with, was, in any event, not pathological and not serious enough for his being classified as of “ unsound mind ”, that is, mentally ill as required by that provision.",
                    "start": 190,
                    "end": 475,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9981937408447266,
                    "word": "Furthermore, Schwalmstadt / Weiterstadt prisons, in which he had been detained, had not been suitable institutions for persons of unsound mind.",
                    "start": 476,
                    "end": 617,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997372031211853,
                    "word": "He had not been offered sufficient therapies tailored to the needs of a mental health patient and had never been placed in a psychiatric hospital.",
                    "start": 618,
                    "end": 764,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "f1530eae-83b1-4296-aad2-bc127224f1b2",
            "start": 0,
            "end": 709,
            "text": "In the Government’s submission, the applicant’s preventive detention had been justified under sub-paragraph (e) of Article 5 § 1. The applicant was a person “of unsound mind” for the purposes of that provision. The domestic courts, having regard to a recent psychiatric expert report, had found in the two sets of proceedings at issue that the applicant suffered from a sufficiently serious, and thus a true mental disorder, namely a dissocial and schizoid personality disorder. Moreover, the applicant had been detained in suitable institutions for the treatment of his mental disorder in the period at issue, in particular, as a result of the offers of therapy made to him (see paragraphs 18-20 above).",
            "agent": "State",
            "paragraph_num": 29,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9996302127838135,
                    "word": "In the Government ’ s submission, the applicant ’ s preventive detention had been justified under sub - paragraph ( e ) of Article 5 § 1.",
                    "start": 0,
                    "end": 129,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9996874928474426,
                    "word": "The applicant was a person “ of unsound mind ” for the purposes of that provision.",
                    "start": 130,
                    "end": 210,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997641444206238,
                    "word": "The domestic courts, having regard to a recent psychiatric expert report, had found in the two sets of proceedings at issue that the applicant suffered from a sufficiently serious, and thus a true mental disorder, namely a dissocial and schizoid personality disorder.",
                    "start": 211,
                    "end": 478,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997570514678955,
                    "word": "Moreover, the applicant had been detained in suitable institutions for the treatment of his mental disorder in the period at issue, in particular, as a result of the offers of therapy made to him ( see paragraphs 18 - 20 above ).",
                    "start": 479,
                    "end": 704,
                    "claim": false
                }
            ]
        }
    ],
    "facts_section": {
        "content": "THE FACTS",
        "elements": [
            {
                "content": "I.  THE CIRCUMSTANCES OF THE CASE",
                "elements": [
                    {
                        "content": "4.  The applicant was born in 1956 and is currently detained in the centre for persons in preventive detention on the premises of Schwalmstadt Prison.",
                        "elements": []
                    },
                    {
                        "content": "A.  Background to the case",
                        "elements": [
                            {
                                "content": "5.  On 6 October 1987 the Landshut Regional Court convicted the applicant, inter alia, of two counts of rape combined with one count of sexual assault, of attempted rape and of aggravated robbery. It sentenced the applicant, who had acted with full criminal responsibility, to thirteen years’ imprisonment. Furthermore, after a first preventive detention order made in that judgment had been quashed by the Federal Court of Justice, the Regional Court, on 25 July 1988, again ordered the applicant’s preventive detention under Article 66 §§ 2 and 1 of the Criminal Code (see paragraph 24 below).",
                                "elements": []
                            },
                            {
                                "content": "6.  The Regional Court found that between June and August 1986 the applicant, having absconded during a leave from prison where he served a term of imprisonment for rape, had again raped a twenty-two-year-old woman and a sixteen-year-old girl on a farm track, had attempted to rape another randomly chosen woman and had stolen two cars by use of threats or force. It had endorsed the findings of medical expert W. who had diagnosed the applicant with a mental abnormality with schizoid and psychopathic elements which was not pathological and thus did not affect the applicant’s criminal responsibility, and with a propensity to commit serious sexual and property offences.",
                                "elements": []
                            },
                            {
                                "content": "7.  On 10 April 2002 the applicant, having fully served his terms of imprisonment, was placed for the first time in preventive detention.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "content": "B.  The first set of proceedings at issue",
                        "elements": [
                            {
                                "content": "8.  On 13 December 2011 the Marburg Regional Court ordered the applicant’s preventive detention to continue also after 9 April 2012, when the applicant would have served ten years in that form of detention.",
                                "elements": []
                            },
                            {
                                "content": "9.  The Regional Court considered that the requirements for an extension of that detention beyond ten years, laid down in Article 67d § 3 of the Criminal Code and modified by the Federal Constitutional Court’s judgment of 4 May 2011 (see paragraph 24 below), were met.",
                                "elements": []
                            },
                            {
                                "content": "10.  Having heard the applicant, his counsel, the prosecution, psychiatric expert J. and a representative of Schwalmstadt Prison, the Regional Court considered that there was still a high risk that the applicant, owing to specific circumstances relating to his person and his conduct, would commit the most serious crimes of violence and sexual offences if released. The Regional Court referred to the applicant’s previous convictions of numerous counts of rape of randomly chosen victims who had suffered most serious mental damage and of robbery by potentially mortal stabs in the chest in this respect. It further noted that the applicant had not completed any of the therapies offered to him to reflect on his offences.",
                                "elements": []
                            },
                            {
                                "content": "11.  Furthermore, the Regional Court found that the applicant suffered from a mental disorder for the purposes of section 1 § 1 of the Therapy Detention Act (see paragraph 24 below). It noted that expert J., in his report dated 15 September 2011, having regard to the relevant tool for the classification of diseases, the ICD-10, had diagnosed the applicant with a dissocial and schizoid personality disorder, which was to be classified as a mental disorder under the said Act. It further had regard to the report dated 27 December 2004, submitted in previous proceedings by psychiatric expert B., who had already diagnosed the applicant with a dissocial personality disorder with schizoid and psychopathic elements.",
                                "elements": []
                            },
                            {
                                "content": "12.  On 13 March 2012 the Frankfurt am Main Court of Appeal, endorsing the reasons given by the Regional Court, dismissed the applicant’s appeal.",
                                "elements": []
                            },
                            {
                                "content": "13.  On 13 June 2013 the Federal Constitutional Court refused to grant the applicant legal aid and declined to consider the applicant’s constitutional complaint (file no. 2 BvR 963/13).",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "content": "C.  The second set of proceedings at issue",
                        "elements": [
                            {
                                "content": "14.  On 23 January 2013 the Marburg Regional Court, having heard the applicant in person, his counsel, the prosecution and a representative of Schwalmstadt Prison and having regard to the report of psychiatric expert J. dated 15 September 2011, again ordered the extension of the applicant’s preventive detention.",
                                "elements": []
                            },
                            {
                                "content": "15.  The Regional Court endorsed the reasons given by the Frankfurt am Main Court of Appeal and by itself in the previous set of proceedings. It further took note, in particular, of the fact that the applicant had proved reliable during several leaves from prison under escort and had taken up work in prison. However, he still had not completed a necessary therapy aimed at preventing him from reoffending.",
                                "elements": []
                            },
                            {
                                "content": "16.  On 14 March 2013 the Frankfurt am Main Court of Appeal dismissed the applicant’s appeal. It referred to the conclusions in its decision dated 13 March 2012 and found that the factual findings and legal assessment made in that decision were still valid. In particular, the applicant kept refusing a necessary therapy.",
                                "elements": []
                            },
                            {
                                "content": "17.  On 13 June 2013 the Federal Constitutional Court refused to grant the applicant legal aid and declined to consider the applicant’s constitutional complaint (file no. 2 BvR 1055/13).",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "content": "D.  The conditions of the applicant’s detention during the execution of the preventive detention order",
                        "elements": [
                            {
                                "content": "18.  At the outset of the execution of the preventive detention order, the applicant was detained in a separate department for persons in preventive detention in Schwalmstadt Prison. From January 2013 onwards he has been detained in a separate building for persons in preventive detention on the premises of Weiterstadt Prison. In the latter building, detainees now disposed of two rooms, each measuring some 11 square metres, and could use the outdoor area during the day. Since spring 2013, the number of staff in the psychology service responsible for persons in preventive detention has been increased and specific therapies, notably a sex offender treatment programme, have been made available. On 20 December 2014 the applicant was transferred to the new centre for persons in preventive detention on the premises of Schwalmstadt Prison.",
                                "elements": []
                            },
                            {
                                "content": "19.  In the Government’s submission, which was not contested by the applicant, both in Schwalmstadt Prison and in Weiterstadt Prison, measures were taken in the interim period between September 2011 and the entry into force of the new legislation on preventive detention on 1 June 2013 (in particular the Act on establishment, at federal level, of a difference between the provisions on preventive detention and those on prison sentences, see paragraph 24 below) by which the conditions of detention for persons in preventive detention and the offers of therapy were gradually improved. The Government submitted that these measures served to comply with the constitutional requirement of differentiating between preventive detention and imprisonment.",
                                "elements": []
                            },
                            {
                                "content": "20.  The applicant refused any specific therapy addressing his offences throughout his preventive detention. In the period at issue, he participated in a weekly discussion group for persons in preventive detention. In May 2013 the applicant was repeatedly invited to participate in the sex offender treatment programme then available in Weiterstadt, which he refused. He worked in detention and was regularly granted leave from prison under escort.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "content": "E.  Other developments",
                        "elements": [
                            {
                                "content": "21.  On 26 April 2012 the Marburg Regional Court dismissed the prosecution’s request to transfer the applicant to a psychiatric hospital for the further execution of his preventive detention under Article 67a § 2 of the Criminal Code (see paragraph 24 below).",
                                "elements": []
                            },
                            {
                                "content": "22.  On 18 November 2013 the Marburg Regional Court again extended the applicant’s preventive detention.",
                                "elements": []
                            }
                        ]
                    }
                ]
            },
            {
                "content": "II.  RELEVANT DOMESTIC LAW AND PRACTICE",
                "elements": [
                    {
                        "content": "23.  A comprehensive summary of the provisions of the Criminal Code and of the Code of Criminal Procedure governing the distinction between penalties and measures of correction and prevention, in particular preventive detention, and the issuing, review and practical implementation of preventive detention orders, is contained in the Court’s judgments in the cases of M. v. Germany (no. 19359/04, §§ 45-68, ECHR 2009), Glien v. Germany (no. 7345/12, §§ 32-52, 28 November 2013) and Bergmann v. Germany (no. 23279/14, §§ 42-76, 7 January 2016).",
                        "elements": []
                    },
                    {
                        "content": "24.  The provisions referred to in the present case, in their versions in force at the relevant time, can be found as follows: the provision on the order of preventive detention by the sentencing court (Article 66 §§ 1 and 2 of the Criminal Code) is set out in the case of Glien (cited above, §§ 33-34). The relevant provisions on judicial review and duration of preventive detention (Article 67e §§ 1 and 2 of the Criminal Code, Article 67d §§ 1 and 3 of the Criminal Code, in the version in force prior to 31 January 1998 and Article 67d § 3 of the Criminal Code in its amended version) are contained in the case of Glien (cited above, §§ 35-37). The rules on the detention of mentally-ill persons (Article 63 of the Criminal Code and section 1 of the Therapy Detention Act) are equally spelled out in the case of Glien (cited above, §§ 38-39). The relevant provision on the transfer for enforcement of a different measure of correction and prevention (Article 67a of the Criminal Code) is also laid down in the case of Glien (cited above, § 41). Information on the Act on establishment, at federal level, of a difference between the provisions on preventive detention and those on prison sentences (Gesetz zur bundesrechtlichen Umsetzung des Abstandsgebotes im Recht der Sicherungsverwahrung, hereinafter the “Preventive Detention (Distinction) Act”) is contained in the case of Bergmann (cited above, §§ 43 et seq.). Finally, a summary of the Federal Constitutional Court’s leading judgment on preventive detention of 4 May 2011 can be found in the case of Bergmann (cited above, §§ 66-72).",
                        "elements": []
                    }
                ]
            }
        ],
        "section_name": "facts"
    },
    "law_section": {
        "content": "THE LAW",
        "elements": [
            {
                "content": "I.  ALLEGED VIOLATION OF ARTICLE 5 § 1 OF THE CONVENTION",
                "elements": [
                    {
                        "content": "25.  The applicant complained that his preventive detention beyond the former statutory ten-year maximum duration had breached his right to liberty as provided in Article 5 § 1 of the Convention, which, in so far as relevant, reads as follows:",
                        "elements": [],
                        "parid": "9a0294b2-0b87-44e5-81ad-60b1584768a2"
                    },
                    {
                        "content": "“1.  Everyone has the right to liberty and security of person. No one shall be deprived of his liberty save in the following cases and in accordance with a procedure prescribed by law:",
                        "elements": [],
                        "parid": "8111cbc8-13db-4b28-8d23-bde3e15aae0f"
                    },
                    {
                        "content": "...",
                        "elements": [],
                        "parid": "b5e0772a-3dc0-41a6-8fe0-d7eb15afcc62"
                    },
                    {
                        "content": "(e)  the lawful detention of persons for the prevention of the spreading of infectious diseases, of persons of unsound mind, alcoholics or drug addicts or vagrants;",
                        "elements": [],
                        "parid": "de5d0587-4441-438a-8bf9-de855ff5bb00"
                    },
                    {
                        "content": "...”",
                        "elements": [],
                        "parid": "9625b819-2ec7-4cea-83bd-e8bd3304ada1"
                    },
                    {
                        "content": "26.  The Government contested that argument.",
                        "elements": [],
                        "parid": "80a8fee8-13b2-4d58-b1d2-5a82be1b4c20"
                    },
                    {
                        "content": "A.  Admissibility",
                        "elements": [
                            {
                                "content": "27.  The Court notes that this complaint is not manifestly ill-founded within the meaning of Article 35 § 3 (a) of the Convention. It further notes that it is not inadmissible on any other grounds. It must therefore be declared admissible.",
                                "elements": [],
                                "parid": "c1ce6a12-4daa-4eb6-b50c-247a841b7c10"
                            }
                        ],
                        "parid": null
                    },
                    {
                        "content": "B.  Merits",
                        "elements": [
                            {
                                "content": "1.  The parties’ submissions",
                                "elements": [
                                    {
                                        "content": "28.  The applicant took the view that his preventive detention at issue had violated Article 5 § 1 of the Convention. In particular, his detention had not been justified under Article 5 § 1 (e). The personality disorder he allegedly suffered from, which 80 to 90 per cent of the prison population could be diagnosed with, was, in any event, not pathological and not serious enough for his being classified as of “unsound mind”, that is, mentally ill as required by that provision. Furthermore, Schwalmstadt/Weiterstadt prisons, in which he had been detained, had not been suitable institutions for persons of unsound mind. He had not been offered sufficient therapies tailored to the needs of a mental health patient and had never been placed in a psychiatric hospital.",
                                        "elements": [],
                                        "parid": "f0b1ffd9-bacc-4e07-9aed-34d1d8c857b0"
                                    },
                                    {
                                        "content": "29.  In the Government’s submission, the applicant’s preventive detention had been justified under sub-paragraph (e) of Article 5 § 1. The applicant was a person “of unsound mind” for the purposes of that provision. The domestic courts, having regard to a recent psychiatric expert report, had found in the two sets of proceedings at issue that the applicant suffered from a sufficiently serious, and thus a true mental disorder, namely a dissocial and schizoid personality disorder. Moreover, the applicant had been detained in suitable institutions for the treatment of his mental disorder in the period at issue, in particular, as a result of the offers of therapy made to him (see paragraphs 18-20 above).",
                                        "elements": [],
                                        "parid": "f1530eae-83b1-4296-aad2-bc127224f1b2"
                                    }
                                ],
                                "parid": null
                            },
                            {
                                "content": "2.  The Court’s assessment",
                                "elements": [
                                    {
                                        "content": "30.  For a summary of the relevant principles in respect of Article 5 § 1 (e) the Court refers to the recapitulation of those principles in its judgment in the case of Bergmann (cited above, §§ 95-99).",
                                        "elements": [],
                                        "parid": "d3c73445-1274-4e23-a054-44395754ba6a"
                                    },
                                    {
                                        "content": "31.  In determining whether the applicant’s retrospectively extended preventive detention was justified under sub-paragraph (e) of Article 5 § 1 as detention of a person “of unsound mind”, the Court, having regard to the elements before it, is satisfied that it was established before the competent domestic courts on the basis of objective medical expertise that the applicant suffered from a true mental disorder for the purposes of that provision. It notes, in particular, that the domestic courts endorsed the findings made by psychiatric expert J., in line with the previous findings of another psychiatric expert, that the applicant suffered from a dissocial and schizoid personality disorder as defined by the ICD-10. That disorder was of a sufficiently serious nature, had manifested itself in the serious offences including rape of randomly chosen victims committed by him and necessitated specific therapeutic treatment. Moreover, in view of the high risk that the applicant would commit further similar serious offences if released, the applicant’s mental disorder was shown to be of a kind or degree warranting compulsory confinement, which, furthermore, depended upon the persistence of that disorder. The applicant was therefore a person “of unsound mind” for the purposes of Article 5 § 1 (e).",
                                        "elements": [],
                                        "parid": "c794e961-fcdf-4615-9372-c29049abbc9c"
                                    },
                                    {
                                        "content": "32.  As for the lawfulness of the applicant’s detention at issue, ordered under Article 67d § 3 of the Criminal Code read in conjunction with the Federal Constitutional Court’s judgment of 4 May 2011, the Court, having regard to the requirements established in its case-law (see paragraph 30 above), must examine whether that detention was effected in a hospital, clinic or other appropriate institution for mental health patients. It observes that during the period here at issue, the applicant was initially detained, from 9 April 2012 (when he had served ten years in preventive detention) until January 2013, in a separate department for persons in preventive detention in Schwalmstadt Prison. The Court, referring to its established case-law in this respect (see, inter alia, O.H. v. , no. 4646/08, §§ 87-92, 24 November 2011; Kronfeldner v. , no. 21906/09, §§ 80-85, 19 January 2012; and Glien v. Germany, no. 7345/12, §§ 92 et seq., 28 November 2013), finds that during the time in which the applicant was detained in Schwalmstadt Prison in the said department, he had not been remanded in an institution suitable for the detention of mental health patients.",
                                        "elements": [],
                                        "parid": "85388825-2a50-4b04-a57d-06b267067857"
                                    },
                                    {
                                        "content": "33.  From January 2013 until a fresh periodic review decision extending the applicant’s preventive detention was taken on 18 November 2013, the applicant was detained in a separate building for persons in preventive detention on the premises of Weiterstadt Prison. In the latter institution, the conditions of detention for persons in preventive detention and the offers of therapy were gradually improved so as to comply with the requirements of the Preventive Detention (Distinction) Act. Having regard to the material before it, the Court observes that in the applicant’s case, there was a considerable change in the institutional setting, the general staffing situation particularly in the psychology service and concerning specific offers of therapy made to the applicant in order to address his mental disorder. In particular, the applicant was repeatedly invited to participate in a sex offender treatment programme in May 2013. The Court can therefore accept that from May 2013 onwards, the applicant was offered the therapeutic environment appropriate for a person detained for being of unsound mind in the building on the premises of Weiterstadt Prison and was thus detained in a suitable institution for the purposes of Article 5 § 1 (e) (compare also Bergmann, cited above, §§ 118-128).",
                                        "elements": [],
                                        "parid": "cfdf7701-6119-48f1-847b-140b51a840c2"
                                    },
                                    {
                                        "content": "34.  It follows that the applicant’s retrospectively extended preventive detention was justified under Article 5 § 1 (e) in the period from May 2013 until 18 November 2013. In contrast, it was not justified under subparagraph (e) of Article 5 § 1 as the lawful detention of a person “of unsound mind”, or under any of the other sub-paragraphs of Article 5 § 1, in the period from 9 April 2012 until May 2013.",
                                        "elements": [],
                                        "parid": "5cfec6a4-dc94-4b6a-a7fb-1dd87d900ce6"
                                    },
                                    {
                                        "content": "35.  There has accordingly been a violation of Article 5 § 1 of the Convention (only) in respect of the applicant’s preventive detention from 9 April 2012 until May 2013.",
                                        "elements": [],
                                        "parid": "a8b39018-0ede-44ba-98dc-a195b1199eb2"
                                    }
                                ],
                                "parid": null
                            }
                        ],
                        "parid": null
                    }
                ],
                "parid": null
            },
            {
                "content": "II.  ALLEGED VIOLATION OF ARTICLE 7 § 1 OF THE CONVENTION",
                "elements": [
                    {
                        "content": "36.  The applicant complained that the retrospective extension of his preventive detention, a penalty, beyond the former ten-year time-limit breached Article 7 § 1 of the Convention, which reads as follows:",
                        "elements": [],
                        "parid": "b42649a6-f400-4921-a3b8-988d76b02163"
                    },
                    {
                        "content": "“1.  No one shall be held guilty of any criminal offence on account of any act or omission which did not constitute a criminal offence under national or international law at the time when it was committed. Nor shall a heavier penalty be imposed than the one that was applicable at the time the criminal offence was committed.”",
                        "elements": [],
                        "parid": "7694b37f-c48d-4403-a0e0-26816e185f23"
                    },
                    {
                        "content": "37.  The Government contested that argument.",
                        "elements": [],
                        "parid": "656e5a5c-5576-490f-a23a-74ec8112f249"
                    },
                    {
                        "content": "A.  Admissibility",
                        "elements": [
                            {
                                "content": "38.  The Court notes that this complaint is not manifestly ill-founded within the meaning of Article 35 § 3 (a) of the Convention. It further notes that it is not inadmissible on any other grounds. It must therefore be declared admissible.",
                                "elements": [],
                                "parid": "6eb6b2b1-bd24-4569-843b-52f069a871be"
                            }
                        ],
                        "parid": null
                    },
                    {
                        "content": "B.  Merits",
                        "elements": [
                            {
                                "content": "1.  The parties’ submissions",
                                "elements": [
                                    {
                                        "content": "39.  The applicant argued that a heavier penalty had been imposed on him retrospectively, contrary to the second sentence of Article 7 § 1 of the Convention, by virtue of the order made for his continued preventive detention. Relying, in particular, on the Court’s judgment in the case of M. v. Germany (cited above), he submitted that preventive detention in the manner in which it was executed in Schwalmstadt and Weiterstadt prisons constituted a “penalty” within the meaning of that provision.",
                                        "elements": [],
                                        "parid": "59128e91-4806-45b8-8856-00b54dcf2c33"
                                    },
                                    {
                                        "content": "40.  In the Government’s submission, the extension of the applicant’s preventive detention beyond 9 April 2012, when he had served the former statutory maximum duration of ten years in that form of detention, had complied with Article 7 § 1 of the Convention. At that time, having regard to the conditions in which the applicant’s preventive detention was executed and in particular the offers of therapy made to him (see paragraphs 18-20 above), that detention could no longer be classified as a penalty.",
                                        "elements": [],
                                        "parid": "8ad86d77-461f-498a-876c-ed836dc31efd"
                                    }
                                ],
                                "parid": null
                            },
                            {
                                "content": "2.  The Court’s assessment",
                                "elements": [
                                    {
                                        "content": "41.  For a summary of the relevant established principles in respect of Article 7 § 1, the Court refers to the recapitulation of those principles in its judgment in the case of Bergmann (cited above, §§ 149-150).",
                                        "elements": [],
                                        "parid": "0d56ddd0-b02e-4e68-8317-f4fa4b7a7c0f"
                                    },
                                    {
                                        "content": "42.  In determining whether, in the present case, the applicant’s retrospectively extended preventive detention constituted a “penalty” for the purposes of the second sentence of Article 7 § 1, the Court has regard to its findings in the cases of Glien (cited above, §§ 120-130) and Bergmann (cited above, §§ 153-183) as well as to its above findings in relation to Article 5. It observes that, just as in the Bergmann case, the preventive detention of the applicant was, and could equally only be, ordered as the applicant was found to suffer from a mental disorder (see, in particular, paragraphs 9, 11 and 24 above).",
                                        "elements": [],
                                        "parid": "1c2b7c50-2bb9-41b6-b99a-6c3957b86216"
                                    },
                                    {
                                        "content": "43.  As regards the nature of the preventive detention measure in the present case, the Court, having regard to its above findings (see paragraphs 32-33), notes that between 9 April 2012 and May 2013, the applicant’s preventive detention was executed in prison under conditions which did not yet permit the conclusion that the focus of the measure lay on the applicant’s medical and therapeutic treatment as a mental health patient. In contrast, from May 2013 onwards, the applicant was detained in Weiterstadt in an institutional setting and under conditions offering him sufficiently individualised care and specific and comprehensive therapy addressing his mental condition, including a sex offender treatment programme.",
                                        "elements": [],
                                        "parid": "af8856f3-283f-4307-be39-e607b28e4fd6"
                                    },
                                    {
                                        "content": "44.  Given these circumstances, the Court concludes that the applicant’s preventive detention as resulting from the impugned decisions between 9 April 2012 and May 2013 still had to be classified as a “penalty” for the purposes of Article 7 § 1. From May 2013 until 18 November 2013, both the nature and the purpose of his preventive detention had substantially changed and the punitive element, and its connection with his criminal conviction, was eclipsed to such an extent that his detention could no longer be classified as a penalty within the meaning of Article 7 § 1.",
                                        "elements": [],
                                        "parid": "12852394-613d-4d45-a5b6-f7377ec9c7ea"
                                    },
                                    {
                                        "content": "45.  There has accordingly been a violation of Article 7 § 1 of the Convention (only) in respect of the applicant’s preventive detention from 9 April 2012 until May 2013.",
                                        "elements": [],
                                        "parid": "9456ac7d-d475-4776-b204-764bab174054"
                                    }
                                ],
                                "parid": null
                            }
                        ],
                        "parid": null
                    }
                ],
                "parid": null
            },
            {
                "content": "III.  APPLICATION OF ARTICLE 41 OF THE CONVENTION",
                "elements": [
                    {
                        "content": "46.  Article 41 of the Convention provides:",
                        "elements": [],
                        "parid": "a627d4cf-105b-4bf2-bc7e-344bbf09361a"
                    },
                    {
                        "content": "“If the Court finds that there has been a violation of the Convention or the Protocols thereto, and if the internal law of the High Contracting Party concerned allows only partial reparation to be made, the Court shall, if necessary, afford just satisfaction to the injured party.”",
                        "elements": [],
                        "parid": "2e502a4f-e1c4-47b1-84db-e30e9185e256"
                    },
                    {
                        "content": "A.  Damage",
                        "elements": [
                            {
                                "content": "47.  The applicant claimed 33,750 euros (EUR) in respect of non-pecuniary damage, arguing that it was equitable to award him EUR 25 per day of preventive detention in breach of the Convention.",
                                "elements": [],
                                "parid": "cd8cf0fe-6e19-4a85-99ed-d4dd9d64d197"
                            },
                            {
                                "content": "48.  The Government considered the applicant’s claim to be excessive.",
                                "elements": [],
                                "parid": "13695c45-fe3c-43e9-ab2e-dd38055f3b56"
                            },
                            {
                                "content": "49.  The Court observes that the applicant was detained in breach of Articles 5 § 1 and 7 § 1 of the Convention from 9 April 2012 until May 2013, which must have caused him distress and frustration. Having regard to the circumstances of the case and making its assessment on an equitable basis, the Court awards the applicant EUR 7,000 in respect of non-pecuniary damage, plus any tax that may be chargeable.",
                                "elements": [],
                                "parid": "edd0a5ad-192d-4af2-989c-0ae66f38c40b"
                            }
                        ],
                        "parid": null
                    },
                    {
                        "content": "B.  Costs and expenses",
                        "elements": [
                            {
                                "content": "50.  The applicant, who had been granted legal aid in the proceedings before this Court, did not make a claim for the costs and expenses incurred before the domestic courts and this Court. Consequently, the Court does not make an award under this head.",
                                "elements": [],
                                "parid": "577f4c3c-e7c8-460a-8a5d-390d4fa7ca7f"
                            }
                        ],
                        "parid": null
                    },
                    {
                        "content": "C.  Default interest",
                        "elements": [
                            {
                                "content": "51.  The Court considers it appropriate that the default interest rate should be based on the marginal lending rate of the European Central Bank, to which should be added three percentage points.",
                                "elements": [],
                                "parid": "9267756a-017c-4dca-bfd9-0563c50c61d4"
                            }
                        ],
                        "parid": null
                    }
                ],
                "parid": null
            }
        ],
        "parid": null
    }
}