{
    "case_id": "001-76762",
    "article": "p1-1",
    "judgment": "no-violation",
    "parties": [
        "THE UNITED KINGDOM",
        "PEARSON"
    ],
    "all_arguments": [
        {
            "paragraph_id": "742c6df1-4a9f-4029-a7de-333a675eb586",
            "start": 0,
            "end": 174,
            "text": "The applicant complained that his entitlement to a State pension accrued at age 65, five years later than for a woman. The relevant provisions of the Convention provide:",
            "agent": "Applicant",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "7c5e4ced-736d-4011-b2a1-ee1abd01a4c5",
            "start": 0,
            "end": 29,
            "text": "Article 14 of the Convention:",
            "agent": "Non-Argument",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "8fa40931-2205-4c0c-9572-75c143e60fc1",
            "start": 0,
            "end": 299,
            "text": "“The enjoyment of the rights and freedoms set forth in [the] Convention shall be secured without discrimination on any ground such as sex, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth or other status.”",
            "agent": "Non-Argument",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "185a7cc3-c513-4a91-af5d-4fd6ed3906ed",
            "start": 0,
            "end": 28,
            "text": "Article 1 of Protocol No. 1:",
            "agent": "Non-Argument",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "a38a3ec0-2bb7-4c13-ba08-08de2a74d73f",
            "start": 0,
            "end": 264,
            "text": "“Every natural or legal person is entitled to the peaceful enjoyment of his possessions. No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.",
            "agent": "Non-Argument",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "aa90c5fd-a3e1-43ef-82ff-6319c78cbf27",
            "start": 0,
            "end": 269,
            "text": "The preceding provisions shall not, however, in any way impair the right of a State to enforce such laws as it deems necessary to control the use of property in accordance with the general interest or to secure the payment of taxes or other contributions or penalties.”",
            "agent": "Non-Argument",
            "paragraph_num": 14
        },
        {
            "paragraph_id": "0f99dfe8-f65a-40aa-9055-a27c50b310b6",
            "start": 0,
            "end": 391,
            "text": "The applicant considered that it was blatant discrimination that almost double the number of women to men were in receipt of the State pension yet they had paid less towards the fund, became eligible earlier and lived longer. Men also had increasing difficulty in finding employment, over half of men over 50 being unemployed, forced into early retirement or in low paid part-time jobs.",
            "agent": "Applicant",
            "paragraph_num": 15
        },
        {
            "paragraph_id": "e801ecd7-b29a-4a90-bf95-78c55a5a5c1c",
            "start": 0,
            "end": 576,
            "text": "The applicant criticised the Government’s policy in reducing the value of the pension and availability of pensions, submitting that economic reasons did not justify the failure to provide pensions in accordance with their citizens’ human rights since they were able to find billions of pounds for military and security purposes and also to subsidise the private company pension schemes. Given the National Insurance Fund had a GBP 30 billion surplus, there was, in his view, no legal or economic basis preventing the Government from equalising State pensions immediately.",
            "agent": "Applicant",
            "paragraph_num": 16
        },
        {
            "paragraph_id": "b1df78f5-352e-406c-9b5c-5ba206c4fd91",
            "start": 0,
            "end": 594,
            "text": "The applicant considered there was a blatant violation of European Union directives, the Human Rights Act and the European Union Social Charter. The Government had for over twenty years made excuses for not equalising State pensions, although economically stronger than  and other countries that did conform. He argued, as regarded the Government’s position that it was necessary to wait to 2020 for equalisation as the change could affect women’s lifestyles, that this had no relevance to human rights or equality and did not justify denying the other half of the population their rights.",
            "agent": "Applicant",
            "paragraph_num": 17
        },
        {
            "paragraph_id": "2c0eb84e-be24-41a4-b009-c612929b48a8",
            "start": 0,
            "end": 883,
            "text": "The Government accepted that Article 1 of Protocol No. 1 applied to the case and that Article 14 was applicable to any discrimination in relation to the availability of the State retirement pension. They submitted that the differential age for men and women had, however, an objective and reasonable justification. They emphasised that the social, historic and economic basis for the provision of the State retirement pension, as well as the decision to equalise the age progressively from 2010-2020 involved complex social and economic judgments in respect of which the Government enjoyed a broad margin of appreciation. It was not a simple case of sex discrimination but involved issues of fair balance under Article 1 of Protocol No. 1 where the Court had stated that it would respect the legislator’s assessment in such matters unless it was devoid of reasonable foundation.",
            "agent": "State",
            "paragraph_num": 18
        },
        {
            "paragraph_id": "20f27d5e-9844-4158-9e16-ff092a66b9f2",
            "start": 0,
            "end": 1459,
            "text": "The Government submitted that Parliament decided to implement the reform to equalise State pensionable ages from 2020 as the measure had enormous financial implications both for individuals and the State. In particular, sudden change would adversely affect the interests of women who had been expecting to receive a State pension at age 60 and a long transitional period gave time for people to adjust their expectations and arrange their affairs accordingly. Nor would it be economically feasible for the Government to provide all 60-year-old men with pensions pending equalisation in 2020 as it would involve the diversion of substantial resources from other State needs (an estimated cost of GBP 75 billion). After a full public consultation exercise, the Government decided to bring the age up to 65 for all based on the considerations that people lived longer and healthier lives, there would be more pensioners supported by fewer people of working age, public expenditure on pensions was set to double by 2035 and occupational schemes were predominantly equalising at the age of 65 already. They pointed out that the European Union had accepted that member States must be allowed a period of transition to plan and implement the move to equal ages. The ’s plans were in line with other developed nations and the European Commission had never suggested that its measures were in any way deficient or disproportionate but had impliedly accepted them.",
            "agent": "State",
            "paragraph_num": 19
        },
        {
            "paragraph_id": "9e5521f5-0e80-44f2-baa1-e290ca0fb124",
            "start": 0,
            "end": 445,
            "text": "The Government referred to the recent judgment in Stec and Others v. the United Kingdom [GC], nos. 65731/01 and 65900/01, 12 April 2006, submitting that this had addressed and disposed of the material issues in the case, in particular that there was a very generous margin of appreciation and that the decisions as to the precise timing and means of putting right the inequality were not so manifestly unreasonable as to exceed this margin.",
            "agent": "State",
            "paragraph_num": 20
        },
        {
            "paragraph_id": "65757c9d-d281-4160-9092-3e1f7be127d0",
            "start": 0,
            "end": 710,
            "text": "Article 14 of the Convention has no independent existence; it has effect solely in relation to “the enjoyment of the rights and freedoms” safeguarded by those provisions. There can be no room for its application unless the facts at issue fall within the ambit of one or more of them (see, amongst other authorities, Gaygusuz v. Austria, judgment of 16 September 1996, Reports of Judgments and Decisions, 1996-IV, § 36). The Court notes that the Government do not contest in this case that the right to receive a State pension falls within the scope of Article 1 of Protocol No. 1 and thus that Article 14 is applicable to any complaint of discrimination in that respect. Article 14 is accordingly engaged.",
            "agent": "ECHR",
            "paragraph_num": 21
        },
        {
            "paragraph_id": "cd094b85-5832-40da-bb6a-4f1da1b02772",
            "start": 0,
            "end": 269,
            "text": "The principal issue in this case is whether the difference in treatment whereby this applicant was unable to receive his State pension until the age of 65 whereas a woman became entitled at age 60, discloses discrimination contrary to Article 14 of the Convention.",
            "agent": "ECHR",
            "paragraph_num": 22
        },
        {
            "paragraph_id": "fe142efe-a79f-41e0-ad31-8e8cdd04f6df",
            "start": 0,
            "end": 797,
            "text": "According to the Court’s case-law, a difference in treatment is discriminatory for the purposes of Article 14 if it “has no objective and reasonable justification”, that is if it does not pursue a “legitimate aim” or if there is not a reasonable relationship of proportionality between the means employed and the aim sought to be realised. The Contracting States enjoy a certain margin of appreciation in assessing whether or not and to what extent differences in otherwise similar situations justify a different treatment. However, very weighty reasons are required before the Court would regard a difference of treatment based exclusively on the grounds of sex as compatible with the Convention (see, among other authorities, Willis v. the United Kingdom, no. 36042/97, ECHR 2002-IV, § 39).",
            "agent": "ECHR",
            "paragraph_num": 23
        },
        {
            "paragraph_id": "a3ef0eae-5655-4031-b723-e68a0f18b168",
            "start": 0,
            "end": 1076,
            "text": "Against this must be balanced the countervailing proposition that the margin of appreciation available to the legislature in implementing social and economic policies should be a wide one (see, inter alia, James v. the United Kingdom, judgment of 21 February 1986, Series A, no. 98, § 46). This applies to systems of taxation or contributions which must inevitably differentiate between groups of tax-payers and the implementation of which unavoidably creates marginal situations. A Government may often have to strike a balance between the need to raise revenue and reflecting other social objectives in taxation policies. The national authorities are obviously in a better position than the Court to assess those needs and requirements, which in the present case involve complex concerns about the financing of pensions which impact on the community as a whole. In such an area the Court will generally respect the legislature’s policy choice unless it is manifestly unreasonable (see, as the latest authority, Stec and Others v. the United Kingdom, cited above, § 52).",
            "agent": "ECHR",
            "paragraph_num": 24
        },
        {
            "paragraph_id": "f6be525b-9e62-49d3-a8a7-0752287342d6",
            "start": 0,
            "end": 335,
            "text": "The Court recalls that in the afore-mentioned Stec case the Grand Chamber had occasion to examine the alleged inequality arising out of entitlement to the reduced earnings allowance which was linked to the State pension. It had this to say about the difference in treatment between men and women as regarded the State pension age.",
            "agent": "ECHR",
            "paragraph_num": 25
        },
        {
            "paragraph_id": "32bbf404-acc5-4031-a6c4-83f46e384d17",
            "start": 0,
            "end": 699,
            "text": "“61. Differential pensionable ages were first introduced for men and women in the in 1940, well before the Convention had come into existence, although the disparity persists to the present day (see paragraph 32 above). It would appear that the difference in treatment was adopted in order to mitigate financial inequality and hardship arising out of the woman’s traditional unpaid role of caring for the family in the home rather than earning money in the workplace. At their origin, therefore, the differential pensionable ages were intended to correct ‘factual inequalities’ between men and women and appear therefore to have been objectively justified under Article 14 (see paragraph 51 above).",
            "agent": "ECHR",
            "paragraph_num": 25
        },
        {
            "paragraph_id": "64c0d086-0247-4ab9-acc7-014918c1568b",
            "start": 0,
            "end": 1086,
            "text": "It follows that the difference in pensionable ages continued to be justified until such time that social conditions had changed so that women were no longer substantially prejudiced because of a shorter working life. This change, must, by its very nature, have been gradual, and it would be difficult or impossible to pinpoint any particular moment when the unfairness to men caused by differential pensionable ages began to outweigh the need to correct the disadvantaged position of women. Certain indications are available to the Court. Thus, in the 1993 White Paper, the Government asserted that the number of women in paid employment had increased significantly, so that whereas in 1967 only 37% of employees were women, the proportion had increased to 50% in 1992. In addition, various reforms to the way in which pension entitlement was assessed had been introduced in 1977 and 1978, to the benefit of women who spent long periods out of paid employment. As of 1986, it was unlawful for an employer to have different retirement ages for men and women (see paragraph 33 above).",
            "agent": "ECHR",
            "paragraph_num": 62
        },
        {
            "paragraph_id": "ca2ed8e3-3883-47d9-8e6d-a19e9faf6156",
            "start": 0,
            "end": 865,
            "text": "According to the information before the Court, the Government made a first, concrete, move towards establishing the same pensionable age for both sexes with the publication of the Green Paper in December 1991. It would, no doubt, be possible to argue that this step could, or should, have been made earlier. However, as the Court has observed, the development of parity in the working lives of men and women has been a gradual process, and one which the national authorities are better placed to assess (see paragraph 52 above). Moreover, it is significant that many of the other Contracting States still maintain a difference in the ages at which men and women become eligible for the State retirement pension (see paragraph 37 above). Within the European Union, this position is recognised by the exception contained in the Directive (see paragraph 38 above).",
            "agent": "ECHR",
            "paragraph_num": 63
        },
        {
            "paragraph_id": "d4b12a99-c3fb-4fcd-8438-1c342274cb7c",
            "start": 0,
            "end": 431,
            "text": "In the light of the original justification for the measure as correcting financial inequality between the sexes, the slowly evolving nature of the change in women’s working lives, and in the absence of a common standard amongst the Contracting States (see Petrovic, cited above, §§ 36-43), the Court finds that the United Kingdom cannot be criticised for not having started earlier on the road towards a single pensionable age.",
            "agent": "ECHR",
            "paragraph_num": 64
        },
        {
            "paragraph_id": "a3c34ebd-a530-4abb-ba0a-215c35ee0610",
            "start": 0,
            "end": 461,
            "text": "Having once begun the move towards equality, moreover, the Court does not consider it unreasonable of the Government to carry out a thorough process of consultation and review, nor can Parliament be condemned for deciding in 1995 to introduce the reform slowly and in stages. Given the extremely far-reaching and serious implications, for women and for the economy in general, these are matters which clearly fall within the State’s margin of appreciation.”",
            "agent": "ECHR",
            "paragraph_num": 65
        },
        {
            "paragraph_id": "5a4dbcf3-5450-484a-828f-a0a2e3a7f96c",
            "start": 0,
            "end": 417,
            "text": "The alleged discrimination in the present case concerns exactly the difference in ages of entitlement to the State pension discussed above. In light of the Grand Chamber’s finding that the policy adopted by the legislature in deferring equalisation of the pension age for men and women until 2020 fell within the State’s margin of appreciation, the Court cannot but reach the same conclusion in the present case.",
            "agent": "ECHR",
            "paragraph_num": 65
        },
        {
            "paragraph_id": "b95e496b-2fec-4c77-9b00-24681b8a4414",
            "start": 0,
            "end": 133,
            "text": "There has, accordingly, been no violation of Article 14 of the Convention taken in conjunction with Article 1 of Protocol No. 1.",
            "agent": "ECHR",
            "paragraph_num": 65
        }
    ],
    "input_arguments": [
        {
            "paragraph_id": "742c6df1-4a9f-4029-a7de-333a675eb586",
            "start": 0,
            "end": 174,
            "text": "The applicant complained that his entitlement to a State pension accrued at age 65, five years later than for a woman. The relevant provisions of the Convention provide:",
            "agent": "Applicant",
            "paragraph_num": 14,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9972406029701233,
                    "word": "The applicant complained that his entitlement to a State pension accrued at age 65, five years later than for a woman.",
                    "start": 0,
                    "end": 118,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9830428957939148,
                    "word": "The relevant provisions of the Convention provide :",
                    "start": 119,
                    "end": 169,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "8fa40931-2205-4c0c-9572-75c143e60fc1",
            "start": 0,
            "end": 299,
            "text": "“The enjoyment of the rights and freedoms set forth in [the] Convention shall be secured without discrimination on any ground such as sex, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth or other status.”",
            "agent": "Non-Argument",
            "paragraph_num": 14,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9891337752342224,
                    "word": "“ The enjoyment of the rights and freedoms set forth in [ the ] Convention shall be secured without discrimination on any ground such as sex, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth or other status. ”",
                    "start": 0,
                    "end": 299,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "185a7cc3-c513-4a91-af5d-4fd6ed3906ed",
            "start": 0,
            "end": 28,
            "text": "Article 1 of Protocol No. 1:",
            "agent": "Non-Argument",
            "paragraph_num": 14,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9085648059844971,
                    "word": "Article 1 of Protocol No. 1 :",
                    "start": 0,
                    "end": 28,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "a38a3ec0-2bb7-4c13-ba08-08de2a74d73f",
            "start": 0,
            "end": 264,
            "text": "“Every natural or legal person is entitled to the peaceful enjoyment of his possessions. No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.",
            "agent": "Non-Argument",
            "paragraph_num": 14,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9741661548614502,
                    "word": "“ Every natural or legal person is entitled to the peaceful enjoyment of his possessions.",
                    "start": 0,
                    "end": 88,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9993342757225037,
                    "word": "No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.",
                    "start": 89,
                    "end": 264,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "aa90c5fd-a3e1-43ef-82ff-6319c78cbf27",
            "start": 0,
            "end": 269,
            "text": "The preceding provisions shall not, however, in any way impair the right of a State to enforce such laws as it deems necessary to control the use of property in accordance with the general interest or to secure the payment of taxes or other contributions or penalties.”",
            "agent": "Non-Argument",
            "paragraph_num": 14,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9944271445274353,
                    "word": "The preceding provisions shall not, however, in any way impair the right of a State to enforce such laws as it deems necessary to control the use of property in accordance with the general interest or to secure the payment of taxes or other contributions or penalties. ”",
                    "start": 0,
                    "end": 269,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "0f99dfe8-f65a-40aa-9055-a27c50b310b6",
            "start": 0,
            "end": 391,
            "text": "The applicant considered that it was blatant discrimination that almost double the number of women to men were in receipt of the State pension yet they had paid less towards the fund, became eligible earlier and lived longer. Men also had increasing difficulty in finding employment, over half of men over 50 being unemployed, forced into early retirement or in low paid part-time jobs.",
            "agent": "Applicant",
            "paragraph_num": 15,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9996834397315979,
                    "word": "The applicant considered that it was blatant discrimination that almost double the number of women to men were in receipt of the State pension yet they had paid less towards the fund, became eligible earlier and lived longer.",
                    "start": 0,
                    "end": 225,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997119903564453,
                    "word": "Men also had increasing difficulty in finding employment, over half of men over 50 being unemployed, forced into early retirement or in low paid part - time jobs.",
                    "start": 226,
                    "end": 386,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "e801ecd7-b29a-4a90-bf95-78c55a5a5c1c",
            "start": 0,
            "end": 576,
            "text": "The applicant criticised the Government’s policy in reducing the value of the pension and availability of pensions, submitting that economic reasons did not justify the failure to provide pensions in accordance with their citizens’ human rights since they were able to find billions of pounds for military and security purposes and also to subsidise the private company pension schemes. Given the National Insurance Fund had a GBP 30 billion surplus, there was, in his view, no legal or economic basis preventing the Government from equalising State pensions immediately.",
            "agent": "Applicant",
            "paragraph_num": 16,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9998167157173157,
                    "word": "The applicant criticised the Government ’ s policy in reducing the value of the pension and availability of pensions, submitting that economic reasons did not justify the failure to provide pensions in accordance with their citizens ’ human rights since they were able to find billions of pounds for military and security purposes and also to subsidise the private company pension schemes.",
                    "start": 0,
                    "end": 386,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997574090957642,
                    "word": "Given the National Insurance Fund had a GBP 30 billion surplus, there was, in his view, no legal or economic basis preventing the Government from equalising State pensions immediately.",
                    "start": 387,
                    "end": 571,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "b1df78f5-352e-406c-9b5c-5ba206c4fd91",
            "start": 0,
            "end": 594,
            "text": "The applicant considered there was a blatant violation of European Union directives, the Human Rights Act and the European Union Social Charter. The Government had for over twenty years made excuses for not equalising State pensions, although economically stronger than  and other countries that did conform. He argued, as regarded the Government’s position that it was necessary to wait to 2020 for equalisation as the change could affect women’s lifestyles, that this had no relevance to human rights or equality and did not justify denying the other half of the population their rights.",
            "agent": "Applicant",
            "paragraph_num": 17,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9997571706771851,
                    "word": "The applicant considered there was a blatant violation of European Union directives, the Human Rights Act and the European Union Social Charter.",
                    "start": 0,
                    "end": 144,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997416734695435,
                    "word": "The Government had for over twenty years made excuses for not equalising State pensions, although economically stronger than and other countries that did conform.",
                    "start": 145,
                    "end": 308,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.99979567527771,
                    "word": "He argued, as regarded the Government ’ s position that it was necessary to wait to 2020 for equalisation as the change could affect women ’ s lifestyles, that this had no relevance to human rights or equality and did not justify denying the other half of the population their rights.",
                    "start": 309,
                    "end": 589,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "2c0eb84e-be24-41a4-b009-c612929b48a8",
            "start": 0,
            "end": 883,
            "text": "The Government accepted that Article 1 of Protocol No. 1 applied to the case and that Article 14 was applicable to any discrimination in relation to the availability of the State retirement pension. They submitted that the differential age for men and women had, however, an objective and reasonable justification. They emphasised that the social, historic and economic basis for the provision of the State retirement pension, as well as the decision to equalise the age progressively from 2010-2020 involved complex social and economic judgments in respect of which the Government enjoyed a broad margin of appreciation. It was not a simple case of sex discrimination but involved issues of fair balance under Article 1 of Protocol No. 1 where the Court had stated that it would respect the legislator’s assessment in such matters unless it was devoid of reasonable foundation.",
            "agent": "State",
            "paragraph_num": 18,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9997983574867249,
                    "word": "The Government accepted that Article 1 of Protocol No. 1 applied to the case and that Article 14 was applicable to any discrimination in relation to the availability of the State retirement pension.",
                    "start": 0,
                    "end": 198,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998112320899963,
                    "word": "They submitted that the differential age for men and women had, however, an objective and reasonable justification.",
                    "start": 199,
                    "end": 314,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.999832034111023,
                    "word": "They emphasised that the social, historic and economic basis for the provision of the State retirement pension, as well as the decision to equalise the age progressively from 2010 - 2020 involved complex social and economic judgments in respect of which the Government enjoyed a broad margin of appreciation.",
                    "start": 315,
                    "end": 621,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9996210932731628,
                    "word": "It was not a simple case of sex discrimination but involved issues of fair balance under Article 1 of Protocol No. 1 where the Court had stated that it would respect the legislator ’ s assessment in such matters unless it was devoid of reasonable foundation.",
                    "start": 622,
                    "end": 878,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "20f27d5e-9844-4158-9e16-ff092a66b9f2",
            "start": 0,
            "end": 1459,
            "text": "The Government submitted that Parliament decided to implement the reform to equalise State pensionable ages from 2020 as the measure had enormous financial implications both for individuals and the State. In particular, sudden change would adversely affect the interests of women who had been expecting to receive a State pension at age 60 and a long transitional period gave time for people to adjust their expectations and arrange their affairs accordingly. Nor would it be economically feasible for the Government to provide all 60-year-old men with pensions pending equalisation in 2020 as it would involve the diversion of substantial resources from other State needs (an estimated cost of GBP 75 billion). After a full public consultation exercise, the Government decided to bring the age up to 65 for all based on the considerations that people lived longer and healthier lives, there would be more pensioners supported by fewer people of working age, public expenditure on pensions was set to double by 2035 and occupational schemes were predominantly equalising at the age of 65 already. They pointed out that the European Union had accepted that member States must be allowed a period of transition to plan and implement the move to equal ages. The ’s plans were in line with other developed nations and the European Commission had never suggested that its measures were in any way deficient or disproportionate but had impliedly accepted them.",
            "agent": "State",
            "paragraph_num": 19,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.9998162388801575,
                    "word": "The Government submitted that Parliament decided to implement the reform to equalise State pensionable ages from 2020 as the measure had enormous financial implications both for individuals and the State.",
                    "start": 0,
                    "end": 204,
                    "claim": true
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998313188552856,
                    "word": "In particular, sudden change would adversely affect the interests of women who had been expecting to receive a State pension at age 60 and a long transitional period gave time for people to adjust their expectations and arrange their affairs accordingly.",
                    "start": 205,
                    "end": 459,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998233318328857,
                    "word": "Nor would it be economically feasible for the Government to provide all 60 - year - old men with pensions pending equalisation in 2020 as it would involve the diversion of substantial resources from other State needs ( an estimated cost of GBP 75 billion ).",
                    "start": 460,
                    "end": 711,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998229742050171,
                    "word": "After a full public consultation exercise, the Government decided to bring the age up to 65 for all based on the considerations that people lived longer and healthier lives, there would be more pensioners supported by fewer people of working age, public expenditure on pensions was set to double by 2035 and occupational schemes were predominantly equalising at the age of 65 already.",
                    "start": 712,
                    "end": 1096,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9998207092285156,
                    "word": "They pointed out that the European Union had accepted that member States must be allowed a period of transition to plan and implement the move to equal ages.",
                    "start": 1097,
                    "end": 1254,
                    "claim": false
                },
                {
                    "entity_group": "Sentence",
                    "score": 0.9997730851173401,
                    "word": "The ’ s plans were in line with other developed nations and the European Commission had never suggested that its measures were in any way deficient or disproportionate but had impliedly accepted them.",
                    "start": 1255,
                    "end": 1454,
                    "claim": false
                }
            ]
        },
        {
            "paragraph_id": "9e5521f5-0e80-44f2-baa1-e290ca0fb124",
            "start": 0,
            "end": 445,
            "text": "The Government referred to the recent judgment in Stec and Others v. the United Kingdom [GC], nos. 65731/01 and 65900/01, 12 April 2006, submitting that this had addressed and disposed of the material issues in the case, in particular that there was a very generous margin of appreciation and that the decisions as to the precise timing and means of putting right the inequality were not so manifestly unreasonable as to exceed this margin.",
            "agent": "State",
            "paragraph_num": 20,
            "arg_units": [
                {
                    "entity_group": "Sentence",
                    "score": 0.999659538269043,
                    "word": "The Government referred to the recent judgment in Stec and Others v. the United Kingdom [ GC ], nos. 65731 / 01 and 65900 / 01, 12 April 2006, submitting that this had addressed and disposed of the material issues in the case, in particular that there was a very generous margin of appreciation and that the decisions as to the precise timing and means of putting right the inequality were not so manifestly unreasonable as to exceed this margin.",
                    "start": 0,
                    "end": 440,
                    "claim": true
                }
            ]
        }
    ],
    "facts_section": {
        "content": "THE FACTS",
        "elements": [
            {
                "content": "I.  THE CIRCUMSTANCES OF THE CASE",
                "elements": [
                    {
                        "content": "7.  The applicant was born in 1942 and lives in .",
                        "elements": []
                    },
                    {
                        "content": "8.  The applicant, aged sixty three, would not become eligible for a State pension until he was sixty five, whereas a woman could claim a State pension from age sixty. He was currently unemployed but if he returned to work he and any potential employer would be liable to make national insurance contributions.",
                        "elements": []
                    },
                    {
                        "content": "9.  On 4 February 2002, the applicant issued proceedings for damages in the High Court against the Benefits Agency, alleging inter alia that the refusal to pay him a pension from the age of sixty was discriminatory. On 2 October 2002, the applicant’s claim was struck out on the basis that the particulars of claim disclosed no reasonable grounds for bringing the claim (Civil Procedure Rule 3.4.2.). On 27 February 2003, permission to appeal was refused.",
                        "elements": []
                    }
                ]
            },
            {
                "content": "II.  RELEVANT DOMESTIC LAW AND PRACTICE",
                "elements": [
                    {
                        "content": "10.  Section 122 of the Social Security Contributions and Benefits Act 1992 defines “pensionable age” as:",
                        "elements": []
                    },
                    {
                        "content": "“(a)  the age of 65, in the case of a man; and",
                        "elements": []
                    },
                    {
                        "content": "(b)  the age of 60, in the case of a woman”.",
                        "elements": []
                    },
                    {
                        "content": "11.  Section 126 of the Pensions Act 1995 provides for the equalisation of State pension ages for men and women to the age of 65. The State pension age for women will increase gradually from 2010 and the equalisation will be complete in 2020. At the same time, the age until which women are liable to pay national insurance contributions will gradually increase in line with the increase in the State pension age.",
                        "elements": []
                    }
                ]
            },
            {
                "content": "III.  EUROPEAN UNION LAW",
                "elements": [
                    {
                        "content": "12.  Council Directive 79/7/EEC of 19 December 1978 provides for the progressive implementation of the principle of equal treatment for men and women in matters of social security. However, in Article 7(1)(a) the Directive provides for derogation in the matter of “the determination of pensionable age for the purposes of granting old-age and retirement pensions and the possible consequences therefore for other benefits”.",
                        "elements": []
                    },
                    {
                        "content": "13.  In Case C-9/91 The Queen v. Secretary of State for Social Security, ex parte Equal Opportunities Commission [1992] ECR 1-4297 (“the EOC case” concerning a reference for a preliminary ruling from the High Court), the European Court of Justice found that:",
                        "elements": []
                    },
                    {
                        "content": "Article 7(1)a had to be interpreted as authorising the determination of a statutory pensionable age which differs according to sex for the purposes of granting old-age and retirement pensions and also forms of discrimination which are necessarily linked to that difference;",
                        "elements": []
                    },
                    {
                        "content": "Inequality between men and women with respect to the length of contribution periods required to obtain a pension constitutes such discrimination where, having regard to the financial equilibrium of the national pension system in the context in which it appears, it cannot be dissociated from a difference in pensionable age;",
                        "elements": []
                    },
                    {
                        "content": "In view of the advantages allowed to women by national pension systems, in particular as regards statutory pensionable age and length of contribution periods, and the disruption that would necessarily be caused to the equilibrium of those systems if the principle of equality between the sexes were to be applied from one day to the next in respect of those periods, the Community legislature intended to authorise the progressive implementation of that principle by the member States and that progressive nature could not be ensured if the scope of the derogation authorised by Article 7(1)a were to be interpreted restrictively.",
                        "elements": []
                    }
                ]
            }
        ],
        "section_name": "facts"
    },
    "law_section": {
        "content": "THE LAW",
        "elements": [
            {
                "content": "ALLEGED VIOLATION OF ARTICLE 14 OF THE CONVENTION IN CONJUNCTION WITH ARTICLE 1 OF PROTOCOL No. 1",
                "elements": [
                    {
                        "content": "14.  The applicant complained that his entitlement to a State pension accrued at age 65, five years later than for a woman. The relevant provisions of the Convention provide:",
                        "elements": [],
                        "parid": "742c6df1-4a9f-4029-a7de-333a675eb586"
                    },
                    {
                        "content": "Article 14 of the Convention:",
                        "elements": [],
                        "parid": "7c5e4ced-736d-4011-b2a1-ee1abd01a4c5"
                    },
                    {
                        "content": "“The enjoyment of the rights and freedoms set forth in [the] Convention shall be secured without discrimination on any ground such as sex, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth or other status.”",
                        "elements": [],
                        "parid": "8fa40931-2205-4c0c-9572-75c143e60fc1"
                    },
                    {
                        "content": "Article 1 of Protocol No. 1:",
                        "elements": [],
                        "parid": "185a7cc3-c513-4a91-af5d-4fd6ed3906ed"
                    },
                    {
                        "content": "“Every natural or legal person is entitled to the peaceful enjoyment of his possessions. No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.",
                        "elements": [],
                        "parid": "a38a3ec0-2bb7-4c13-ba08-08de2a74d73f"
                    },
                    {
                        "content": "The preceding provisions shall not, however, in any way impair the right of a State to enforce such laws as it deems necessary to control the use of property in accordance with the general interest or to secure the payment of taxes or other contributions or penalties.”",
                        "elements": [],
                        "parid": "aa90c5fd-a3e1-43ef-82ff-6319c78cbf27"
                    },
                    {
                        "content": "A.  The parties’ submissions",
                        "elements": [
                            {
                                "content": "1.  The applicant",
                                "elements": [
                                    {
                                        "content": "15.  The applicant considered that it was blatant discrimination that almost double the number of women to men were in receipt of the State pension yet they had paid less towards the fund, became eligible earlier and lived longer. Men also had increasing difficulty in finding employment, over half of men over 50 being unemployed, forced into early retirement or in low paid part-time jobs.",
                                        "elements": [],
                                        "parid": "0f99dfe8-f65a-40aa-9055-a27c50b310b6"
                                    },
                                    {
                                        "content": "16.  The applicant criticised the Government’s policy in reducing the value of the pension and availability of pensions, submitting that economic reasons did not justify the failure to provide pensions in accordance with their citizens’ human rights since they were able to find billions of pounds for military and security purposes and also to subsidise the private company pension schemes. Given the National Insurance Fund had a GBP 30 billion surplus, there was, in his view, no legal or economic basis preventing the Government from equalising State pensions immediately.",
                                        "elements": [],
                                        "parid": "e801ecd7-b29a-4a90-bf95-78c55a5a5c1c"
                                    },
                                    {
                                        "content": "17.  The applicant considered there was a blatant violation of European Union directives, the Human Rights Act and the European Union Social Charter. The Government had for over twenty years made excuses for not equalising State pensions, although economically stronger than  and other countries that did conform. He argued, as regarded the Government’s position that it was necessary to wait to 2020 for equalisation as the change could affect women’s lifestyles, that this had no relevance to human rights or equality and did not justify denying the other half of the population their rights.",
                                        "elements": [],
                                        "parid": "b1df78f5-352e-406c-9b5c-5ba206c4fd91"
                                    }
                                ],
                                "parid": null
                            },
                            {
                                "content": "2.  The Government",
                                "elements": [
                                    {
                                        "content": "18.  The Government accepted that Article 1 of Protocol No. 1 applied to the case and that Article 14 was applicable to any discrimination in relation to the availability of the State retirement pension. They submitted that the differential age for men and women had, however, an objective and reasonable justification. They emphasised that the social, historic and economic basis for the provision of the State retirement pension, as well as the decision to equalise the age progressively from 2010-2020 involved complex social and economic judgments in respect of which the Government enjoyed a broad margin of appreciation. It was not a simple case of sex discrimination but involved issues of fair balance under Article 1 of Protocol No. 1 where the Court had stated that it would respect the legislator’s assessment in such matters unless it was devoid of reasonable foundation.",
                                        "elements": [],
                                        "parid": "2c0eb84e-be24-41a4-b009-c612929b48a8"
                                    },
                                    {
                                        "content": "19.  The Government submitted that Parliament decided to implement the reform to equalise State pensionable ages from 2020 as the measure had enormous financial implications both for individuals and the State. In particular, sudden change would adversely affect the interests of women who had been expecting to receive a State pension at age 60 and a long transitional period gave time for people to adjust their expectations and arrange their affairs accordingly. Nor would it be economically feasible for the Government to provide all 60-year-old men with pensions pending equalisation in 2020 as it would involve the diversion of substantial resources from other State needs (an estimated cost of GBP 75 billion). After a full public consultation exercise, the Government decided to bring the age up to 65 for all based on the considerations that people lived longer and healthier lives, there would be more pensioners supported by fewer people of working age, public expenditure on pensions was set to double by 2035 and occupational schemes were predominantly equalising at the age of 65 already. They pointed out that the European Union had accepted that member States must be allowed a period of transition to plan and implement the move to equal ages. The ’s plans were in line with other developed nations and the European Commission had never suggested that its measures were in any way deficient or disproportionate but had impliedly accepted them.",
                                        "elements": [],
                                        "parid": "20f27d5e-9844-4158-9e16-ff092a66b9f2"
                                    },
                                    {
                                        "content": "20.  The Government referred to the recent judgment in Stec and Others v. the United Kingdom [GC], nos. 65731/01 and 65900/01, 12 April 2006, submitting that this had addressed and disposed of the material issues in the case, in particular that there was a very generous margin of appreciation and that the decisions as to the precise timing and means of putting right the inequality were not so manifestly unreasonable as to exceed this margin.",
                                        "elements": [],
                                        "parid": "9e5521f5-0e80-44f2-baa1-e290ca0fb124"
                                    }
                                ],
                                "parid": null
                            }
                        ],
                        "parid": null
                    },
                    {
                        "content": "B.  The Court’s assessment",
                        "elements": [
                            {
                                "content": "21.  Article 14 of the Convention has no independent existence; it has effect solely in relation to “the enjoyment of the rights and freedoms” safeguarded by those provisions. There can be no room for its application unless the facts at issue fall within the ambit of one or more of them (see, amongst other authorities, Gaygusuz v. Austria, judgment of 16 September 1996, Reports of Judgments and Decisions, 1996-IV, § 36). The Court notes that the Government do not contest in this case that the right to receive a State pension falls within the scope of Article 1 of Protocol No. 1 and thus that Article 14 is applicable to any complaint of discrimination in that respect. Article 14 is accordingly engaged.",
                                "elements": [],
                                "parid": "65757c9d-d281-4160-9092-3e1f7be127d0"
                            },
                            {
                                "content": "22.  The principal issue in this case is whether the difference in treatment whereby this applicant was unable to receive his State pension until the age of 65 whereas a woman became entitled at age 60, discloses discrimination contrary to Article 14 of the Convention.",
                                "elements": [],
                                "parid": "cd094b85-5832-40da-bb6a-4f1da1b02772"
                            },
                            {
                                "content": "23.  According to the Court’s case-law, a difference in treatment is discriminatory for the purposes of Article 14 if it “has no objective and reasonable justification”, that is if it does not pursue a “legitimate aim” or if there is not a reasonable relationship of proportionality between the means employed and the aim sought to be realised. The Contracting States enjoy a certain margin of appreciation in assessing whether or not and to what extent differences in otherwise similar situations justify a different treatment. However, very weighty reasons are required before the Court would regard a difference of treatment based exclusively on the grounds of sex as compatible with the Convention (see, among other authorities, Willis v. the United Kingdom, no. 36042/97, ECHR 2002-IV, § 39).",
                                "elements": [],
                                "parid": "fe142efe-a79f-41e0-ad31-8e8cdd04f6df"
                            },
                            {
                                "content": "24.  Against this must be balanced the countervailing proposition that the margin of appreciation available to the legislature in implementing social and economic policies should be a wide one (see, inter alia, James v. the United Kingdom, judgment of 21 February 1986, Series A, no. 98, § 46). This applies to systems of taxation or contributions which must inevitably differentiate between groups of tax-payers and the implementation of which unavoidably creates marginal situations. A Government may often have to strike a balance between the need to raise revenue and reflecting other social objectives in taxation policies. The national authorities are obviously in a better position than the Court to assess those needs and requirements, which in the present case involve complex concerns about the financing of pensions which impact on the community as a whole. In such an area the Court will generally respect the legislature’s policy choice unless it is manifestly unreasonable (see, as the latest authority, Stec and Others v. the United Kingdom, cited above, § 52).",
                                "elements": [],
                                "parid": "a3ef0eae-5655-4031-b723-e68a0f18b168"
                            },
                            {
                                "content": "25.  The Court recalls that in the afore-mentioned Stec case the Grand Chamber had occasion to examine the alleged inequality arising out of entitlement to the reduced earnings allowance which was linked to the State pension. It had this to say about the difference in treatment between men and women as regarded the State pension age.",
                                "elements": [],
                                "parid": "f6be525b-9e62-49d3-a8a7-0752287342d6"
                            },
                            {
                                "content": "“61. Differential pensionable ages were first introduced for men and women in the  in 1940, well before the Convention had come into existence, although the disparity persists to the present day (see paragraph 32 above). It would appear that the difference in treatment was adopted in order to mitigate financial inequality and hardship arising out of the woman’s traditional unpaid role of caring for the family in the home rather than earning money in the workplace. At their origin, therefore, the differential pensionable ages were intended to correct ‘factual inequalities’ between men and women and appear therefore to have been objectively justified under Article 14 (see paragraph 51 above).",
                                "elements": [],
                                "parid": "32bbf404-acc5-4031-a6c4-83f46e384d17"
                            },
                            {
                                "content": "62. It follows that the difference in pensionable ages continued to be justified until such time that social conditions had changed so that women were no longer substantially prejudiced because of a shorter working life. This change, must, by its very nature, have been gradual, and it would be difficult or impossible to pinpoint any particular moment when the unfairness to men caused by differential pensionable ages began to outweigh the need to correct the disadvantaged position of women. Certain indications are available to the Court. Thus, in the 1993 White Paper, the Government asserted that the number of women in paid employment had increased significantly, so that whereas in 1967 only 37% of employees were women, the proportion had increased to 50% in 1992. In addition, various reforms to the way in which pension entitlement was assessed had been introduced in 1977 and 1978, to the benefit of women who spent long periods out of paid employment. As of 1986, it was unlawful for an employer to have different retirement ages for men and women (see paragraph 33 above).",
                                "elements": [],
                                "parid": "64c0d086-0247-4ab9-acc7-014918c1568b"
                            },
                            {
                                "content": "63. According to the information before the Court, the Government made a first, concrete, move towards establishing the same pensionable age for both sexes with the publication of the Green Paper in December 1991. It would, no doubt, be possible to argue that this step could, or should, have been made earlier. However, as the Court has observed, the development of parity in the working lives of men and women has been a gradual process, and one which the national authorities are better placed to assess (see paragraph 52 above). Moreover, it is significant that many of the other Contracting States still maintain a difference in the ages at which men and women become eligible for the State retirement pension (see paragraph 37 above). Within the European Union, this position is recognised by the exception contained in the Directive (see paragraph 38 above).",
                                "elements": [],
                                "parid": "ca2ed8e3-3883-47d9-8e6d-a19e9faf6156"
                            },
                            {
                                "content": "64. In the light of the original justification for the measure as correcting financial inequality between the sexes, the slowly evolving nature of the change in women’s working lives, and in the absence of a common standard amongst the Contracting States (see Petrovic, cited above, §§ 36-43), the Court finds that the United Kingdom cannot be criticised for not having started earlier on the road towards a single pensionable age.",
                                "elements": [],
                                "parid": "d4b12a99-c3fb-4fcd-8438-1c342274cb7c"
                            },
                            {
                                "content": "65. Having once begun the move towards equality, moreover, the Court does not consider it unreasonable of the Government to carry out a thorough process of consultation and review, nor can Parliament be condemned for deciding in 1995 to introduce the reform slowly and in stages. Given the extremely far-reaching and serious implications, for women and for the economy in general, these are matters which clearly fall within the State’s margin of appreciation.”",
                                "elements": [],
                                "parid": "a3c34ebd-a530-4abb-ba0a-215c35ee0610"
                            },
                            {
                                "content": "26.  The alleged discrimination in the present case concerns exactly the difference in ages of entitlement to the State pension discussed above. In light of the Grand Chamber’s finding that the policy adopted by the legislature in deferring equalisation of the pension age for men and women until 2020 fell within the State’s margin of appreciation, the Court cannot but reach the same conclusion in the present case.",
                                "elements": [],
                                "parid": "5a4dbcf3-5450-484a-828f-a0a2e3a7f96c"
                            },
                            {
                                "content": "27.  There has, accordingly, been no violation of Article 14 of the Convention taken in conjunction with Article 1 of Protocol No. 1.",
                                "elements": [],
                                "parid": "b95e496b-2fec-4c77-9b00-24681b8a4414"
                            }
                        ],
                        "parid": null
                    }
                ],
                "parid": null
            }
        ],
        "parid": null
    }
}